АрендаКвартир/src/InformationRegisters/ЦеныНаКвартиры/ЦеныНаКвартиры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНаКвартиры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаЗаДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АрендаКвартир/src/CommonModules/ЦеныНаКвартиры/Module.bsl
#Область ПрограммныйИнтерфейс

// Цена номенклатуры.
// 
// Параметры:
//  Квартира - СправочникСсылка.Квартиры
//  Период - Дата, Неопределено - Период
// 
// Возвращаемое значение:
//  Число - Цена за день аренды
//
Функция ЦенаНаКвартиру(Квартира, Период = Неопределено) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Квартира", Квартира);
	
	РеквизитыЗаписи = РегистрыСведений.ЦеныНаКвартиры.ПолучитьПоследнее(Период, Отбор);
	
	Возврат РеквизитыЗаписи.ЦенаЗаДень;
	
КонецФункции

#КонецОбласти
